[
  {
    "id": 1,
    "name": "BPL Dream11",
    "description": "A platform where users can select and buy players, including their details like name, country, and role. Users need to claim credit to buy players.",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "JavaScript",
      "React",
      "React Router"
    ],
    "image": "https://i.ibb.co.com/jk7pXCbh/bpl-dream11.jpg",
    "live": "https://bpl-dream11-2024.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/BPL-DREAM11",
    "server_repo": "https://github.com/asifmahmud1047/BPL-DREAM11",
    "fade_direction": "left",
    "features": [
      "Fantasy Cricket Platform: BPL Dream11 provides an interactive platform where users can build fantasy teams by selecting real-life players from the Bangladesh Premier League.",
      "Player Acquisition System: Users can purchase players using claimed credits to assemble their dream teams.",
      "Credit Claim Mechanism: Users must claim credits before buying players, ensuring they have sufficient balance for transactions.",
      "Player Details: Each player profile includes essential information such as name, country, role (e.g., batsman, bowler, all-rounder), and performance stats.",
      "Team Management: Users can strategize by selecting, trading, or releasing players based on their budget and team requirements."
    ]
  },
  
  {
    "id": 2,
    "name": "Peddy Pet Adoption Platform",
    "description": "A dynamic pet adoption platform where users can browse and adopt pets. This project showcases a fully responsive web application built to provide a seamless experience across all devices, allowing users to explore pets, view detailed information, and even adopt their new best friend. The platform is designed using modern web technologies, utilizing various APIs for fetching data dynamically.",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "JavaScript",
      "API Integration"
    ],
    "image": "https://i.ibb.co.com/gMjzHLsb/peddy-pet-adoption.jpg",
    "live": "https://peddy-pet-adoption-organization.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/Peddy-Pet-Adoption-Platform",
    "server_repo": "https://github.com/asifmahmud1047/Peddy-Pet-Adoption-Platform",
    "fade_direction": "left",
    "features": [
    "Dynamic Pet Browsing: Users can view all pets and filter them based on categories like dogs, cats, birds, etc.",
    "Adopt Process: Users can adopt pets, which triggers a countdown and updates the adoption status.",
    "Sorting by Price: Pets can be sorted by price to help users find the most suitable pet.",
    "Like Functionality: Users can like their favorite pets, and liked pets are displayed in a grid.",
    "Responsive Design: The platform is fully responsive, providing a seamless experience across devices using Tailwind CSS."
    ]
  },
  {
    "id": 3,
    "name": "Donate Bangladesh",
    "description": "A digital platform designed to facilitate seamless and secure donations for social causes, nonprofits, and emergency relief efforts across Bangladesh. Users can contribute to verified initiatives, track their donations, and receive updates on the impact of their contributions",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "JavaScript"
    ],
    "image": "https://i.ibb.co.com/svhdvdHX/flood-donate.jpg",
    "live": "https://a10-online-study.web.app",
    "client_repo": "https://github.com/HabiburRahman02/a11_online_study_client",
    "server_repo": "https://github.com/HabiburRahman02/a11_online_study_server",
    "fade_direction": "left",
    "features": [
      "Charitable Donation Platform: An online system enabling users to donate to verified NGOs, disaster relief programs, educational funds, and healthcare initiatives in Bangladesh.",
      "Cause Categories: Users can choose from diverse causes such as poverty alleviation, flood relief, education for underprivileged children, healthcare access, and animal welfare."
    ]
  },
  {
    "id": 4,
    "name": "Rinterio - Design House",
    "description": "A full range of interior design services, including residential and commercial design, space planning, furniture selection, color consultation, and project management. We tailor our services to meet the unique needs and preferences of each client.",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "JavaScript"
    ],
    "image": "https://i.ibb.co.com/DfnNnFpz/rinterio.jpg",
    "live": "https://rinterio-design-house.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/Rinterio",
    "server_repo": "https://github.com/asifmahmud1047/Rinterio",
    "fade_direction": "up",
    "features": [
      "Residential & Commercial Design Services: Expertise in designing homes, offices, retail spaces, and more, with a focus on functionality and aesthetics.",
      "Tailored Design Solutions: Customized approaches to meet individual client needs, preferences, and budget constraints.",
      "Structured Design Process: A phased workflow including consultation, concept development (mood boards, layouts, material selection), approval, and implementation."
    ]
  }
]