[
  {
    "id": 1,
    "name": "Lingo Bingo - Japanese Vocabulary Learning Application",
    "description": "A fun and interactive language learning application designed to help users expand their Japanese vocabulary and improve their communication skills.",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "JavaScript",
      "React",
      "React Router",
      "React CountUp",
      "Firebase",
      "AOS (Animate On Scroll)",
      "React Toastify",
      "Web Speech API"
    ],
    "image": "https://i.ibb.co.com/8nWyMKS7/lingo.jpg",
    "live": "https://lingo-bingo-a-vocabulary-learning-app.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/Lingo-Bingo-A-Vocabulary-Learning-Application",
    "server_repo": "https://github.com/asifmahmud1047/Lingo-Bingo-A-Vocabulary-Learning-Application",
    "fade_direction": "left",
    "features": [
      "User Authentication: Secure login/registration system using Firebase Authentication.",
      "Japanese Vocabulary Cards: Interactive cards displaying Japanese words with meanings, pronunciation, and usage examples.",
      "Lesson-Based Structure: Organized lessons with vocabulary grouped by difficulty and theme.",
      "Text-to-Speech: Hear the correct pronunciation of Japanese words.",
      "Video Tutorials: Watch embedded YouTube videos to enhance your learning experience.",
      "Responsive Design: Fully responsive layout for mobile, tablet, and desktop viewing.",
      "User Profile: Personalized user profiles with the ability to update information",
      "Animated Elements: Visual feedback and animations to enhance user experience"
    ]
  },

  {
    "id": 2,
    "name": "Gadget Heaven✨ - E-commerce Platform",
    "description": "A modern e-commerce platform for gadget enthusiasts, offering a wide range of electronic devices and accessories. Used various features to provide a seamless shopping experience.",
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "React",
      "React Router",
      "React Rating Stars",
      "FontAwesome Icons",
      "Recharts (for statistics visualization)",
      "React Toastify"
    ],
    "image": "https://i.ibb.co.com/ymMXYths/gadget-heaven.jpg",
    "live": "https://gadget-heaven-platform.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/Gadget-Haven-E-commerce-Platform",
    "server_repo": "https://github.com/asifmahmud1047/Gadget-Haven-E-commerce-Platform",
    "fade_direction": "left",
    "features": [
      "Responsive Design: The website is fully responsive and works seamlessly across all device sizes.",
      "Category Filtering: Users can browse products by categories such as computers, phones, smart watches, chargers, and power banks.",
      "Shopping Cart System: Add products to cart, remove items, sort by price, and view total price. The cart has a maximum limit of $1000.",
      "Wishlist Management: Save products for later, move items from wishlist to cart, and manage your wishlist items.",
      "Persistent Data: Cart and wishlist data are stored in localStorage, ensuring data persists between sessions.",
      "Interactive UI Elements: Toast notifications, active route indicators, and smooth animations enhance the user experience.",
      "Statistics Page: View product prices and ratings in an interactive chart"
    ]
  },

  {
    "id": 3,
    "name": "BPL Dream11",
    "description": "A platform where users can select and buy players, including their details like name, country, and role. Users need to claim credit to buy players.",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "JavaScript",
      "React",
      "React Router"
    ],
    "image": "https://i.ibb.co.com/jk7pXCbh/bpl-dream11.jpg",
    "live": "https://bpl-dream11-2024.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/BPL-DREAM11",
    "server_repo": "https://github.com/asifmahmud1047/BPL-DREAM11",
    "fade_direction": "left",
    "features": [
      "Fantasy Cricket Platform: BPL Dream11 provides an interactive platform where users can build fantasy teams by selecting real-life players from the Bangladesh Premier League.",
      "Player Acquisition System: Users can purchase players using claimed credits to assemble their dream teams.",
      "Credit Claim Mechanism: Users must claim credits before buying players, ensuring they have sufficient balance for transactions.",
      "Player Details: Each player profile includes essential information such as name, country, role (e.g., batsman, bowler, all-rounder), and performance stats.",
      "Team Management: Users can strategize by selecting, trading, or releasing players based on their budget and team requirements."
    ]
  },

  {
    "id": 4,
    "name": "Peddy Pet Adoption Platform",
    "description": "A dynamic pet adoption platform where users can browse and adopt pets. This project showcases a fully responsive web application built to provide a seamless experience across all devices, allowing users to explore pets, view detailed information, and even adopt their new best friend. The platform is designed using modern web technologies, utilizing various APIs for fetching data dynamically.",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "JavaScript",
      "API Integration"
    ],
    "image": "https://i.ibb.co.com/gMjzHLsb/peddy-pet-adoption.jpg",
    "live": "https://peddy-pet-adoption-organization.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/Peddy-Pet-Adoption-Platform",
    "server_repo": "https://github.com/asifmahmud1047/Peddy-Pet-Adoption-Platform",
    "fade_direction": "left",
    "features": [
      "Dynamic Pet Browsing: Users can view all pets and filter them based on categories like dogs, cats, birds, etc.",
      "Adopt Process: Users can adopt pets, which triggers a countdown and updates the adoption status.",
      "Sorting by Price: Pets can be sorted by price to help users find the most suitable pet.",
      "Like Functionality: Users can like their favorite pets, and liked pets are displayed in a grid.",
      "Responsive Design: The platform is fully responsive, providing a seamless experience across devices using Tailwind CSS."
    ]
  },
  {
    "id": 5,
    "name": "Donate Bangladesh",
    "description": "A digital platform designed to facilitate seamless and secure donations for social causes, nonprofits, and emergency relief efforts across Bangladesh. Users can contribute to verified initiatives, track their donations, and receive updates on the impact of their contributions",
    "technologies": ["HTML", "CSS", "Tailwind", "JavaScript"],
    "image": "https://i.ibb.co.com/svhdvdHX/flood-donate.jpg",
    "live": "https://donate-in-bangladesh.netlify.app/",
    "client_repo": "https://github.com/asifmahmud1047/Donate-Bangladesh",
    "server_repo": "https://github.com/asifmahmud1047/Donate-Bangladesh",
    "fade_direction": "left",
    "features": [
      "Charitable Donation Platform: An online system enabling users to donate to verified NGOs, disaster relief programs, educational funds, and healthcare initiatives in Bangladesh.",
      "Cause Categories: Users can choose from diverse causes such as poverty alleviation, flood relief, education for underprivileged children, healthcare access, and animal welfare."
    ]
  }
]